// передача структурных переменных в функцию

#include <iostream>
using namespace std;
///////////////////////////////////////////////////////////
struct Distance			// длинна в английской системе
{
	int feet;	
	float inches;			
};
///////////////////////////////////////////////////////////
void engldisp(Distance);	// объявление
int main()
{
	Distance d1, d2;		// определение двух полей
					// ввод значений полей d1
	cout << "Введите число футов: "; cin >> d1.feet;
	cout << "Введите число дюймов: "; cin >> d1.inches;

	Distance d2 = { 11, 6.25 };	// определение с инициализацией
					// ввод полей переменной d1
	cout << "\nВведите число футов: "; cin >> d1.feet;
	cout << "Введите число дюймов: "; cin >> d1.inches;
					// ввод полей переменной d2
	cout << "\nВведите число футов: "; cin >> d2.feet;
	cout << "Введите число дюймов: "; cin >> d2.inches;
	cout << "\nd1= ";
	engldisp(d1);	// вывод значения d1
	cout << "\nd2= ";
	engldisp(d2);	// вывод значения d2
	cout << endl;
	return 0;
}
//----------------------------------------------------------
// функция engldisp(), отображающая значения 
// полей структурной переменной типа distance 
void engldisp(Distance dd) // параметр dd типа Distance
{
	cout << dd.feet << "\'-" << dd.inches << "\"";
}



