// применение перегрузки оператора для счетчика
// увеличение переменной операцией ++
#include <iostream>
using namespace std;
//////////////////////////////////////////////////////////////////////////////
class Counter
{
	private:
		unsigned int count;		// значение счетчика
	public:
		Counter() : count(0)		// конструктор
			{ /* пустое тело */ }
		unsigned int get_count()	// получение значения счетчика
			{ return count; }
		void operator++()		// увеличить значение
			{ ++count; }
};
//////////////////////////////////////////////////////////////////////////////
int main()
{
	Counter c1, c2;				// определение с инициализацией
	cout << "\nc1 =" << c1.get_cont();	// вывод
	cout << "\nc2 =" << c2.get_cont();
	++c1;				// инкреминирование с1
	++c2;				// инкреминирование с2
	++c2;				// инкреминирование с2
	cout << "\nc1 =" << c1.get_count();	// вывод
	cout << "\nc2 =" << c2.get_count();
	cout << endl;
	return 0;
}