// доступ к виртуальным функциям через указатели

#include <iostream>
using namespace std;
//////////////////////////////////////////////////////////////////////////////
class Base 				// базовый класс
{
public:
	virtual void show()			// Виртуальная функция
		{ cout << "Base\n"; }
};
//////////////////////////////////////////////////////////////////////////////
class Derv1 : public Base		// производный класс 1
{
public:
	void show()
		{ cout << "Derv1\n"; }
};
//////////////////////////////////////////////////////////////////////////////
class Derv2 : public Base		// производный класс 2
{
public:
	void show()
		{ cout << "Derv2\n"; }
};
//////////////////////////////////////////////////////////////////////////////
int main
{
	Derv1 dv1;			// объект производного класса 1
	Derv2 dv2;			// объект производного класса 2
	Base* ptr;			// указатель на базовый класс
	
	ptr = &dv1;			// адрес dv1 занести в указатель
	ptr->show();			// выполнить show()
	ptr = &dv2;			// адрес dv2 занести в указатель
	ptr->show();			// выполнить show()
	
	return 0;
}